{"keras_version": "1.1.2", "config": [{"config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_1", "activity_regularizer": null, "nb_filter": 32, "b_constraint": null, "W_constraint": null, "input_dtype": "float32", "batch_input_shape": [null, 30, 30, 3], "dim_ordering": "tf", "W_regularizer": null, "nb_row": 3, "nb_col": 3, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_2", "activity_regularizer": null, "nb_filter": 16, "b_constraint": null, "W_constraint": null, "dim_ordering": "tf", "W_regularizer": null, "nb_row": 3, "nb_col": 3, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "border_mode": "valid", "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "maxpooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "b_regularizer": null, "name": "dense_1", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 10, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "bias": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "b_regularizer": null, "name": "dense_2", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "output_dim": 1, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "bias": true, "activation": "sigmoid"}, "class_name": "Dense"}], "class_name": "Sequential"}